Revit 2024 API
IFCAnyHandle.GetHashCode Method
 Gets the integer value of the id as hash code
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override int GetHashCode()
Visual Basic
Public Overrides Function GetHashCode As Integer
Visual C++
public:
virtual int GetHashCode() override
See Also
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace